## QIWI SQL test

<p>This training is based on QIWI test for product analysts<p>
<p>Link for the task https://docs.google.com/document/d/11zlINPq2dbAXd9WgMfH7Z_7Tkimuqg6abUo78at2fKI/edit <p>

I created my own database based on the description. It was required to find number of users who have registered in QIWI wallet and other products during last week.

## Data exploration:

<p>table: identification:<p>

<p>- user_id - Primary key, has a different meaning for the user depending on the product.<p>
<p>- product_id = 1 - registration ID in QIWI wallet.<p>
<p>- identification_date - date of passing KYC<p>

<p>Table table_with_personal_data containing KYC data.<p>

<p>- user_id - Primary key, has a different value for each user depending on the product<p>
<p>- pers_key_id - 4 series of the passport<p>
<p>- pers_key_id - 5 passport number<p>
<p>- pers_value - contains information according to user_id and pers_key_id<p>

## Goal of the request:

<p>You need to get the number of users who have registered in other products over the past week, while having registration in a QIWI wallet.<p>

<p>I decompose the goal into tasks:<p>

<p> 1. You need to get a list of user_id who registered in the last week in a QIWI wallet from the identification table.<p>
<p>2. You need to get the KYC data of users of the first request from the table_with_personal_data table<p>
<p>3. It is necessary to match the KYC of users who have registered in other products and have registered in a QIWI wallet in the last week<p>
<p>4. You need to get the number of users registered in other products for the last week, while having registration in a QIWI wallet.<p>

## Database preparation 
I have created two tables within DBeaver and filled them. 
<p> CREATE TABLE identification (user_id text, product_id int, identification_date date) <p>
<p> CREATE TABLE table_with_personal_data (user_id text, pers_key_id int, pers_value text) <p>

In [1]:
import pandas as pd
%load_ext sql 
%sql postgresql://postgres:sqltest123@localhost/qiwi

In [9]:
%%sql identification <<
SELECT *
FROM identification

 * postgresql://postgres:***@localhost/qiwi
20 rows affected.
Returning data to local variable identification

In [16]:
#displaying results for SQL request
identification = identification.DataFrame()
display(identification .head(20))

   user_id  product_id identification_date
0     0001           1          2022-12-28
1     0002           1          2022-12-27
2     0003           1          2022-12-26
3     0004           1          2022-12-25
4     0005           1          2022-12-24
5     0006           1          2022-12-23
6     0007           1          2022-12-22
7     0008           1          2022-12-21
8     0009           1          2022-12-20
9     0010           1          2022-12-19
10    0011           2          2022-12-28
11    0012           2          2022-12-27
12    0013           2          2022-12-26
13    0014           2          2022-12-25
14    0015           2          2022-12-24
15    0016           2          2022-12-23
16    0017           2          2022-12-22
17    0018           2          2022-12-21
18    0019           2          2022-12-20
19    0020           2          2022-12-19

In [17]:
%%sql KYC <<
SELECT * 
FROM table_with_personal_data

 * postgresql://postgres:***@localhost/qiwi
40 rows affected.
Returning data to local variable KYC

In [18]:
#displaying results for SQL request
KYC = KYC.DataFrame()
display(KYC.head(20))

   user_id  pers_key_id pers_value
0     0001            4       0101
1     0001            5       1010
2     0002            4       0202
3     0002            5       2020
4     0003            4       0303
5     0003            5       3030
6     0004            4       0404
7     0004            5       4040
8     0005            4       0505
9     0005            5       5050
10    0006            4       0606
11    0006            5       6060
12    0007            4       0707
13    0007            5       7070
14    0008            4       0808
15    0008            5       8080
16    0009            4       0909
17    0009            5       9090
18    0010            4      01011
19    0010            5      10101

## Task 1
Get a list of user_id who registered in the last week in a QIWI wallet from the identification table.

In [34]:
%%sql task1 <<
SELECT user_id, product_id, identification_date
FROM identification
WHERE (identification_date BETWEEN CURRENT_DATE - 7 AND CURRENT_DATE)
AND product_id = 1

 * postgresql://postgres:***@localhost/qiwi
8 rows affected.
Returning data to local variable task1

In [35]:
#displaying results for SQL request
task1 = task1.DataFrame()
display(task1.head(10))

  user_id  product_id identification_date
0    0001           1          2022-12-28
1    0002           1          2022-12-27
2    0003           1          2022-12-26
3    0004           1          2022-12-25
4    0005           1          2022-12-24
5    0006           1          2022-12-23
6    0007           1          2022-12-22
7    0008           1          2022-12-21

Here we have users who have registered QIWI wallet during past week.

## Task 2
need to get the KYC data of users of the first request from the table_with_personal_data table

In [37]:
%%sql task2 <<
SELECT pers_value
FROM table_with_personal_data
WHERE user_id IN (SELECT user_id
				  FROM identification
				  WHERE (identification_date BETWEEN CURRENT_DATE - 7 AND CURRENT_DATE)
				  AND product_id = 1)

 * postgresql://postgres:***@localhost/qiwi
16 rows affected.
Returning data to local variable task2

In [38]:
#displaying results for SQL request
task2 = task2.DataFrame()
display(task2.head(20))

   pers_value
0        0101
1        1010
2        0202
3        2020
4        0303
5        3030
6        0404
7        4040
8        0505
9        5050
10       0606
11       6060
12       0707
13       7070
14       0808
15       8080

## Task 3
match the KYC of users who have registered in other products and have registered in a QIWI wallet in the last week

In [39]:
%%sql task3 <<
SELECT DISTINCT i.user_id, product_id, identification_date
FROM identification AS i
LEFT JOIN table_with_personal_data AS tpd ON i.user_id = tpd.user_id
WHERE product_id != 1
AND pers_value IN (SELECT pers_value
				   FROM table_with_personal_data
WHERE user_id IN (SELECT user_id
				 FROM identification
				 WHERE (identification_date BETWEEN CURRENT_DATE - 7 AND CURRENT_DATE)
				 AND product_id = 1) )

 * postgresql://postgres:***@localhost/qiwi
8 rows affected.
Returning data to local variable task3

In [40]:
#displaying results for SQL request
task3 = task3.DataFrame()
display(task3.head(20))

  user_id  product_id identification_date
0    0011           2          2022-12-28
1    0012           2          2022-12-27
2    0013           2          2022-12-26
3    0014           2          2022-12-25
4    0015           2          2022-12-24
5    0016           2          2022-12-23
6    0017           2          2022-12-22
7    0018           2          2022-12-21

## Task 4 (final request for goal)
need to get the number of users registered in other products for the last week, while having registration in a QIWI wallet

In [42]:
%%sql task4 <<
SELECT COUNT (DISTINCT i.user_id)
FROM identification AS i
LEFT JOIN table_with_personal_data AS tpd ON i.user_id = tpd.user_id
WHERE product_id != 1
AND pers_value IN (SELECT pers_value
				   FROM table_with_personal_data
WHERE user_id IN (SELECT user_id
				 FROM identification
				 WHERE (identification_date BETWEEN CURRENT_DATE - 7 AND CURRENT_DATE)
				 AND product_id = 1) )

 * postgresql://postgres:***@localhost/qiwi
1 rows affected.
Returning data to local variable task4

In [43]:
#displaying results for SQL request
task4 = task4.DataFrame()
display(task4.head(1))

   count
0      8